# n=1 : 1,2,3,4,5,6,7,8,9 = 9
# n=2 : 10,12,21,23,32,34,...,98 (2*8 + 1) = 17
# n=3 : 101,123,121, 210,212,232,234, ..., 876,878,898, 987,989

N = int(input())
dp = [[0] * 10 for _ in range(N+1)] # dp[a][b] : a자리 수 숫자의 맨 끝이 b인 경우의 수

# n=1 초기화
for i in range(1, 10):
  dp[1][i] = 1

for i in range(2, N+1):
  for j in range(0, 10):
    if j == 0:
      dp[i][j] = dp[i-1][1] # 끝자리 0 되려면 무조건 1에서 와야함
    elif j== 9:
      dp[i][j] = dp[i-1][8] # 끝자리 9 되려면 무조건 8에서 와야함
    else:
      dp[i][j] = dp[i-1][j-1] + dp[i-1][j+1]

print(sum(dp[N]) % 1000000000)